Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: The OpenEmbedded build system uses the template configuration files, which are found by default in the ``meta/conf/templates/default`` directory in :term:`OpenEmbedded-Core (OE-Core)`. See the ":ref:`dev-manual/custom-template-configuration-directory:creating a custom template configuration directory`" section in the Yocto Project Development Tasks Manual for more information.
it_it: Il sistema di build OpenEmbedded utilizza i file di configurazione dei template, che si trovano per default nella directory ``meta/conf/templates/default`` in :term:`OpenEmbedded-Core (OE-Core)`. Per ulteriori informazioni, consultare la sezione ":ref:`dev-manual/custom-template-configuration-directory:creating a custom template configuration directory`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: The OpenEmbedded build system uses this directory for the shared state manifest files. The shared state code uses these files to record the files installed by each sstate task so that the files can be removed when cleaning the recipe or when a newer version is about to be installed. The build system also uses the manifests to detect and produce a warning when files from one task are overwriting those from another.
it_it: Il sistema di build OpenEmbedded utilizza questa directory per i file manifest dello "shared state" [stato condiviso]. Il codice di "shared state" utilizza questi file per registrare i file installati da ciascuna attività di stato condiviso, in modo che possano essere rimossi durante la pulizia della ricetta o quando sta per essere installata una versione più recente. Il sistema di build utilizza inoltre i manifest per rilevare e generare un warning quando i file di un task sovrascrivono quelli di un'altro.

source: The OpenEmbedded build system uses this directory to create symbolic links to some of the host components that are allowed to be called within tasks. These are basic components listed in the :ref:`ref-manual/system-requirements:required packages for the build host` section. These components are also listed in the :term:`HOSTTOOLS` variable and are limited to this list to prevent host contamination.
it_it: Il sistema di build OpenEmbedded utilizza questa directory per creare link simbolici ad alcuni componenti host che possono essere richiamati all'interno dei task. Questi sono i componenti di base elencati nella sezione :ref:`ref-manual/system-requirements:required packages for the build host`. Questi componenti sono elencati anche nella variabile :term:`HOSTTOOLS` e sono limitati a questo elenco per evitare la contaminazione dell'host.

source: The OpenEmbedded build system uses this directory to store package metadata generated during the :ref:`ref-tasks-packagedata` task. The files stored in this directory contain information about each output package produced by the OpenEmbedded build system, and are used in different ways by the build system such as ":ref:`dev-manual/debugging:viewing package information with ``oe-pkgdata-util```".
it_it: Il sistema di build OpenEmbedded utilizza questa directory per memorizzare i metadati dei pacchetti generati durante il task :ref:`ref-tasks-packagedata`. I file memorizzati in questa directory contengono informazioni su ciascun pacchetto di output prodotto dal sistema di build OpenEmbedded e vengono utilizzati in diversi modi dal sistema di build, ad esempio per ":ref:`dev-manual/debugging:viewing package information with ``oe-pkgdata-util```".

source: The OpenEmbedded-Core (OE-Core) Metadata --- ``meta/``
it_it: Metadati di OpenEmbedded-Core (OE-Core) --- ``meta/``

source: The QA/testing infrastructure is woven into the project to the point where core developers take some of it for granted. The infrastructure consists of the following pieces:
it_it: L'infrastruttura di QA/testing è talmente integrata nel progetto che gli sviluppatori principali la danno per scontata. L'infrastruttura è composta dai seguenti elementi:

source: The SystemTap language reference can be found here: `SystemTap Language Reference <https://sourceware.org/systemtap/langref.html>`__
it_it: Il riferimento al linguaggio SystemTap è disponibile qui: `Riferimento al Linguaggio SystemTap <https://sourceware.org/systemtap/langref.html>`__

source: The SystemTap support in Yocto assumes that only steps 3 and 4 are run on the target; it is possible to do everything on the target, but this section assumes only the typical embedded use-case.
it_it: Il supporto SystemTap in Yocto presuppone che sul sistema target vengano eseguiti solo i passaggi 3 e 4; è possibile eseguire tutte le operazioni sul sistema target, ma questa sezione considera solo il tipico caso d'uso embedded.

source: The Tex Live installation above is only valid for `x86_64` hosts.
it_it: L'installazione di TeX Live sopra descritta è valida solo per sistemi host `x86_64`.

source: The Toaster web interface allows you to do the following:
it_it: L'interfaccia web di Toaster consente di eseguire le seguenti operazioni:

source: The Windows Subsystem For Linux allows Windows to run a real Linux kernel inside of a lightweight virtual machine (VM).
it_it: Il Windows Subsystem For Linux consente a Windows di eseguire un kernel Linux reale all'interno di una macchina virtuale (VM) leggera.

source: The YP security team organizes its meetings and communication as needed.
it_it: Il team di sicurezza YP organizza riunioni e comunicazioni in base alle necessità.

source: The Yocto Project :term:`OpenEmbedded Build System` produces packages in standard formats (i.e. RPM, DEB and/or IPK). If you included :ref:`runtime package management<dev-manual/packages:using runtime package management>` in your image, you can deploy these packages into the running system on the target by using the corresponding utilities on the target such as ``rpm``/``dnf``, ``dpkg``/``apt`` or ``opkg``.
it_it: L':term:`OpenEmbedded Build System` di Yocto Project produce pacchetti in formati standard (ad esempio RPM, DEB e/o IPK). Se nell'immagine è stata inclusa la :ref:`gestione dei pacchetti in fase di runtime <dev-manual/packages:using runtime package management>`, si possono distribuire questi pacchetti nel sistema in esecuzione sul sistema target utilizzando le utilità corrispondenti, come ``rpm``/``dnf``, ``dpkg``/``apt`` o ``opkg``.

source: The Yocto Project :yocto_wiki:`Technical Steering Committee (TSC) </TSC>` makes decisions on features in this status and Autobuilder testing. Such support would be dropped if the maintainers/testing were inactive.
it_it: Il :yocto_wiki:`Technical Steering Committee (TSC) </TSC>` di Yocto Project prende le decisioni sulle funzionalità in questo stato e sui test dell'Autobuilder. Tale supporto verrebbe interrotto se i manutentori/tester fossero inattivi.

source: The Yocto Project Development Environment
it_it: L'Ambiente di Sviluppo di Yocto Project

source: The Yocto Project Development Tasks Manual
it_it: Il Manuale di Sviluppo dei Task di Yocto Project

source: The Yocto Project Git repositories may also have upstream contribution Git repositories suffixed with ``-contrib``. You can see all the branches of these repositories using the web interface of the :yocto_git:`Source Repositories <>`. These branches hold changes (commits) to the project that have been submitted or committed by the Yocto Project development team and by community members who contribute to the project. The maintainer determines if the changes are qualified to be moved from the "contrib" branches into the "master" branch of the Git repository.
it_it: I repository Git di Yocto Project possono anche avere repository Git di contributi upstream con suffisso ``-contrib``. È possibile visualizzare tutti i branch di questi repository tramite l'interfaccia web di :yocto_git:`Source Repositories <>`. Questi branch contengono le modifiche (commit) al progetto state inviate o confermate dal team di sviluppo di Yocto Project e dai membri della community che contribuiscono al progetto. Il manutentore determina se le modifiche sono idonee per essere spostate dai branch "contrib" al branch "master" del repository Git.

source: The Yocto Project Layer Model
it_it: Il Modello a Layer di Yocto Project

source: The Yocto Project Security Team consists of at least three members. When new members are needed, the Yocto Project Technical Steering Committee (YP TSC) asks for nominations by public channels including a nomination deadline. Self-nominations are possible. When the limit time is reached, the YP TSC posts the list of candidates for the comments of project participants and developers. Comments may be sent publicly or privately to the YP and OE TSCs. The candidates are approved by both YP TSC and OpenEmbedded Technical Steering Committee (OE TSC) and the final list of the team members is announced publicly. The aim is to have people representing technical leadership, security knowledge and infrastructure present with enough people to provide backup/coverage but keep the notification list small enough to minimize information risk and maintain trust.
it_it: Lo Yocto Project Security Team è composto da almeno tre membri. Quando si rende necessario l'inserimento di nuovi membri, lo Yocto Project Technical Steering Committee (YP TSC) richiede candidature tramite canali pubblici, con una scadenza per la presentazione delle candidature. È possibile anche presentare autocandidature. Allo scadere del termine, l'YP TSC pubblica l'elenco dei candidati per raccogliere i commenti dei partecipanti al progetto e degli sviluppatori. I commenti possono essere inviati pubblicamente o privatamente all'YP TSC e all'OE TSC. I candidati vengono approvati sia dall'YP TSC che dall'OpenEmbedded Technical Steering Committee (OE TSC) e l'elenco definitivo dei membri del team viene reso pubblico. L'obiettivo è quello di avere presenti persone che rappresentino la leadership tecnica, le competenze in materia di sicurezza e infrastruttura, con un numero sufficiente di persone per garantire supporto/copertura, mantenendo al contempo l'elenco delle notifiche sufficientemente ristretto per minimizzare il rischio informativo e preservare la fiducia.

source: The Yocto Project Security team adheres to the 90 days disclosure policy by default. An increase of the embargo time is possible when necessary.
it_it: Lo Yocto Project Security aderisce di default alla politica di divulgazione di 90 giorni. Se necessario, è possibile prolungare il periodo di embargo.

source: The Yocto Project and OpenEmbedded are open-source, community-based projects so contributions are very welcome, it is how the code evolves and everyone can effect change. Contributions take different forms, if you have a fix for an issue you've run into, a patch is the most appropriate way to contribute it. If you run into an issue but don't have a solution, opening a defect in :yocto_bugs:`Bugzilla <>` or asking questions on the mailing lists might be more appropriate. This guide intends to point you in the right direction to this.
it_it: Yocto Project e OpenEmbedded sono progetti open-source basati sulla community, quindi i contributi sono benvenuti: è così che il codice si evolve e chiunque può apportare modifiche. I contributi possono assumere diverse forme: se si ha una soluzione per un problema riscontrato, una patch è il modo più appropriato per contribuire. Se si riscontra un problema ma non si ha una soluzione, segnalare un difetto in :yocto_bugs:`Bugzilla <>` o porre domande sulle mailing list potrebbe essere più appropriato. Questa guida ha lo scopo di indicare la giusta direzione.

source: The Yocto Project and OpenEmbedded are open-source, community-based projects used in numerous products. They assemble multiple other open-source projects, and need to handle security issues and practices both internal (in the code maintained by both projects), and external (maintained by other projects and organizations).
it_it: Yocto Project e OpenEmbedded sono progetti open source, basati sulla community, utilizzati in numerosi prodotti. Essi integrano diversi altri progetti open source e devono gestire problematiche e pratiche di sicurezza sia interne (nel codice gestito da entrambi i progetti) che esterne (gestite da altri progetti e organizzazioni).

source: The Yocto Project and OpenEmbedded ecosystem is built of :term:`layers <Layer>` so the first step is to identify the component where the issue likely lies. For example, if you have a hardware issue, it is likely related to the BSP you are using and the best place to seek advice would be from the BSP provider or :term:`layer`. If the issue is a build/configuration one and a distro is in use, they would likely be the first place to ask questions. If the issue is a generic one and/or in the core classes or metadata, the core layer or BitBake might be the appropriate component.
it_it: L'ecosistema Yocto Project e OpenEmbedded è costituito da :term:`layer <Layer>`, quindi il primo passo è identificare il componente in cui è più probabile che risieda il problema. Ad esempio, se si riscontra un problema hardware, è probabile che sia correlato al BSP in uso e il posto migliore a cui rivolgersi per chiedere consiglio è il fornitore del BSP o il :term:`layer`. Se il problema riguarda la compilazione/configurazione e si utilizza una distribuzione, quest'ultima sarà probabilmente il primo punto di riferimento. Se il problema è generico e/o riguarda le classi principali o i metadati, il componente appropriato potrebbe essere il core layer o BitBake.

source: The Yocto Project and OpenEmbedded follow the guidance of the Linux Foundation in regards to the use of generative AI tools. See: https://www.linuxfoundation.org/legal/generative-ai.
it_it: Yocto Project e OpenEmbedded seguono le linee guida della Linux Foundation per quanto riguarda l'utilizzo di strumenti di IA generativa. Vedere: https://www.linuxfoundation.org/legal/generative-ai.

source: The Yocto Project delivers major releases (e.g. 6.1) using a six month cadence roughly timed each April and October of the year. Here are examples of some major YP releases with their codenames also shown. See the ":ref:`ref-manual/release-process:major release codenames`" section for information on codenames used with major releases.
it_it: Yocto Project ha rilasci "major" (ad esempio la 6.1) con una cadenza di sei mesi, all'incirca ad aprile e ottobre di ogni anno. Ecco alcuni esempi di rilasci principali di YP con i relativi nomi in codice. Consultare la sezione ":ref:`ref-manual/release-process:major release codenames`" per informazioni sui nomi in codice utilizzati per i rilasci principali [major].

source: The Yocto Project development environment usually involves a :term:`Build Host` and target hardware. You use the Build Host to build images and develop applications, while you use the target hardware to execute deployed software.
it_it: L'ambiente di sviluppo di Yocto Project prevede in genere un :term:`Build Host` e un hardware target. Il Build Host viene utilizzato per creare immagini e sviluppare applicazioni, mentre l'hardware target viene utilizzato per eseguire il software distribuito.

source: The Yocto Project does most of the work for you when it comes to creating :ref:`sdk-manual/intro:the cross-development toolchain`. This section provides some technical background on how cross-development toolchains are created and used. For more information on toolchains, you can also see the :doc:`/sdk-manual/index` manual.
it_it: Yocto Project semplifica notevolmente la creazione delle :ref:`sdk-manual/intro:the cross-development toolchain`. Questa sezione fornisce alcune informazioni tecniche su come vengono create e utilizzate le toolchain di cross-sviluppo. Per ulteriori informazioni sulle toolchain, è possibile consultare anche il manuale :doc:`/sdk-manual/index`.

source: The Yocto Project employs a collection of components and tools used by the project itself, by project developers, and by those using the Yocto Project. These components and tools are open source projects and metadata that are separate from the reference distribution (:term:`Poky`) and the :term:`OpenEmbedded Build System`. Most of the components and tools are downloaded separately.
it_it: Yocto Project utilizza una serie di componenti e strumenti impiegati dal progetto stesso, dagli sviluppatori del progetto e da coloro che utilizzano Yocto Project. Questi componenti e strumenti sono progetti open source e metadati separati dalla distribuzione di riferimento (:term:`Poky`) e il :term:`OpenEmbedded Build System`. La maggior parte dei componenti e degli strumenti viene scaricata separatamente.

source: The Yocto Project files are maintained using Git in "branches" whose Git histories track every change and whose structures provide branches for all diverging functionality. Although there is no need to use Git, many open source projects do so.
it_it: I file di Yocto Project vengono gestiti tramite Git in "branches", le cui cronologie Git tengono traccia di ogni modifica e la cui struttura fornisce branch per tutte le funzionalità divergenti. Sebbene non sia obbligatorio utilizzare Git, molti progetti open source lo fanno.

source: The Yocto Project has an infrastructure to track and address unfixed known security vulnerabilities, as tracked by the public :wikipedia:`Common Vulnerabilities and Exposures (CVE) <Common_Vulnerabilities_and_Exposures>` database.
it_it: Yocto Project dispone di un'infrastruttura per tracciare e risolvere le vulnerabilità di sicurezza note e non ancora corrette, monitorate dal database pubblico :wikipedia:`Common Vulnerabilities and Exposures (CVE) <Common_Vulnerabilities_and_Exposures>`.

source: The Yocto Project has security flags that you can enable that help make your build output more secure. The security flags are in the ``meta/conf/distro/include/security_flags.inc`` file in :term:`OpenEmbedded-Core (OE-Core)`.
it_it: Yocto Project dispone di flag di sicurezza che è possibile abilitare per rendere più sicuro l'output della build. I flag di sicurezza si trovano nel file ``meta/conf/distro/include/security_flags.inc`` all'interno di :term:`OpenEmbedded-Core (OE-Core)`.

source: The Yocto Project implements shared state code that supports incremental builds. The implementation of the shared state code answers the following questions that were fundamental roadblocks within the OpenEmbedded incremental build support system:
it_it: Yocto Project implementa un codice di "shared state" che supporta le compilazioni incrementali. L'implementazione di questo codice risponde alle seguenti domande, che rappresentavano ostacoli fondamentali per il sistema di supporto alle compilazioni incrementali di OpenEmbedded:

source: The Yocto Project is an open source collaboration project that helps developers create custom Linux-based systems that are designed for embedded products regardless of the product's hardware architecture. Yocto Project provides a flexible toolset and a development environment that allows embedded device developers across the world to collaborate through shared technologies, software stacks, configurations, and best practices used to create these tailored Linux images.
it_it: Yocto Project è un progetto collaborativo open source che aiuta gli sviluppatori a creare sistemi personalizzati basati su Linux, progettati per prodotti embedded indipendentemente dall'architettura hardware del prodotto. Yocto Project fornisce un set di strumenti flessibile e un ambiente di sviluppo che consente agli sviluppatori di dispositivi embedded di tutto il mondo di collaborare attraverso tecnologie, stack software, configurazioni e best practice condivise per creare queste immagini Linux personalizzate.

source: The Yocto Project is putting continuous efforts into testing the changes made to the :term:`OpenEmbedded-Core (OE-Core)` metadata and core tools. The details on how this test environment functions is described in the :doc:`/test-manual/index`.
it_it: Yocto Project si impegna costantemente a testare le modifiche apportate ai metadati e agli strumenti principali di :term:`OpenEmbedded-Core (OE-Core)`. I dettagli sul funzionamento di questo ambiente di test sono descritti nel :doc:`/test-manual/index`.

source: The Yocto Project maintains a `list of known vulnerabilities <https://valkyrie.yocto.io/pub/non-release/patchmetrics/>`__ for packages in :term:`OpenEmbedded-Core (OE-Core)`, tracking the evolution of the number of unpatched CVEs and the status of patches. Such information is available for the current development version and for each supported release.
it_it: Yocto Project mantiene un `elenco di vulnerabilità note <https://valkyrie.yocto.io/pub/non-release/patchmetrics/>`__ per i pacchetti di :term:`OpenEmbedded-Core (OE-Core)`, monitorando l'evoluzione del numero di CVE non ancora corrette e lo stato delle patch. Queste informazioni sono disponibili per la versione di sviluppo corrente e per ogni release supportata.

source: The Yocto Project makes extensive use of Git, which is a free, open source distributed version control system. Git supports distributed development, non-linear development, and can handle large projects. It is best that you have some fundamental understanding of how Git tracks projects and how to work with Git if you are going to use the Yocto Project for development. This section provides a quick overview of how Git works and provides you with a summary of some essential Git commands.
it_it: Yocto Project fa ampio uso di Git, un sistema di controllo di versione distribuito, gratuito e open source. Git supporta lo sviluppo distribuito, lo sviluppo non lineare e può gestire progetti di grandi dimensioni. È consigliabile avere una conoscenza di base di come Git gestisce i progetti e di come utilizzarlo se si intende utilizzare Yocto Project per lo sviluppo. Questa sezione fornisce una rapida panoramica del funzionamento di Git e un riepilogo di alcuni comandi Git essenziali.

source: The Yocto Project provides tools for making your image more secure. You can find these tools in the ``meta-security`` layer of the :yocto_git:`Yocto Project Source Repositories <>`.
it_it: Yocto Project fornisce strumenti per rendere l'immagine più sicura. Si possono trovare questi strumenti nel layer ``meta-security`` dei :yocto_git:`Repository del Codice Sorgente di Yocto Project <>`.

source: The Yocto Project provides two scripts that conveniently let you generate and send pull requests to the Yocto Project. These scripts are ``create-pull-request`` and ``send-pull-request``. You can find these scripts in the ``scripts`` directory within :term:`OpenEmbedded-Core (OE-Core)`.
it_it: Yocto Project fornisce due script che consentono di generare e inviare facilmente pull request a Yocto Project. Questi script sono ``create-pull-request`` e ``send-pull-request``. Si trovano nella directory ``scripts`` in :term:`OpenEmbedded-Core (OE-Core)`.

source: The Yocto Project release process is predictable and consists of both major and minor (point) releases. This brief chapter provides information on how releases are named, their life cycle, and their stability.
it_it: Il processo di rilascio di Yocto Project è prevedibile e consiste in rilasci principali [major] e secondari [minor] (punto). Questo breve capitolo fornisce informazioni su come vengono denominati i rilasci, sul loro ciclo di vita e sulla loro stabilità.
